Закупки/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Закупки/src/Documents/ВнутренниеЗаявки/ВнутренниеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутренниеЗаявки</name>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияТоваров</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадоПриобрести</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаявки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Закупки/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ТекущееКоличество < Объект.МинимальноеКоличество Тогда
		СоздатьЗаявку();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура СоздатьЗаявку()
	Если Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", Объект.Ссылка).Пустая() Тогда
		НовЗаявка = Документы.ВнутренниеЗаявки.СоздатьДокумент();
		НовЗаявка.Дата = ТекущаяДата();
		НовЗаявка.Товар = Объект.Ссылка;
		НовЗаявка.КатегорияТоваров = Справочники.КатегорииТоваров.НайтиПоНаименованию(Объект.Родитель.Наименование);
		НовЗаявка.Цена = Объект.Цена;
		НовЗаявка.Количество = Объект.МаксимальноеКоличество - Объект.ТекущееКоличество;
		НовЗаявка.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", Объект.Ссылка).ПолучитьОбъект();
		ТекЗаявка.Количество = Объект.МаксимальноеКоличество - Объект.ТекущееКоличество;
		ТекЗаявка.Записать();
	КонецЕсли;
КонецПроцедуры
